lib/tasks/credits.rake

SELECT "actors".* FROM "actors" WHERE "actors"."email" = 'emersonargueta92@gmail.com' LIMIT 1
UPDATE "actors" SET "balance_cents" = 100000000, "updated_at" = '2026-05-07 13:45:04.667079' WHERE "actors"."id" = 1
---
  task seed: :environment do
    email        = ENV.fetch("EMAIL") { abort "Usage: rails credits:seed EMAIL=you@example.com" }
    amount_cents = ENV.fetch("AMOUNT_CENTS", "100_000_000").delete("_").to_i

    actor = Actor.find_by!(email: email.downcase)
    actor.update!(balance_cents: amount_cents)