app/controllers/api/auth_controller.rb

INSERT INTO "actors" ("email", "password_digest", "created_at", "updated_at") VALUES ('emersonargueta92@gmail.com', '$2a$12$RdmIjA1ZddDm3g3Y7m3jWevWrBa3RmU6jgwvkOtBPhViynibdk1Fa', '2026-05-06 14:40:29.470514', '2026-05-06 14:40:29.470514') RETURNING "id"
---
    def register
      actor = Actor.new(
        email: params.require(:email),
        password: params.require(:password),
        password_confirmation: params.require(:password_confirmation)
      )

      if actor.save

SELECT "actors".* FROM "actors" WHERE "actors"."email" = 'emersonargueta92@gmail.com' LIMIT 1
---
    def login
      actor = Actor.find_by(email: params.require(:email)&.downcase)