app/controllers/api/webhooks/stripe_controller.rb

      def handle_payment_intent_succeeded(payment_intent)
        actor_id = payment_intent.metadata["actor_id"]
        return unless actor_id

        # Idempotency — skip if already credited via the client-side flow
        return if CapabilityLog.exists?(
          capability:          "add_credits",
          status:              "success",
          provider_request_id: payment_intent.id
        )

        actor = Actor.find_by(id: actor_id)
        return unless actor

        actor.credit!(payment_intent.amount)

        CapabilityLog.create!(
          actor_id:            actor_id,
          capability:          "add_credits",
          provider:            "stripe",
          provider_request_id: payment_intent.id,
          raw_cost_cents:      0,
          markup_cents:        0,
          total_charged_cents: 0,
          charged_to:          "actor",
          status:              "success",
          invoked_at:          Time.current,
          completed_at:        Time.current
        )
---
SELECT 1 AS one FROM "capability_logs" WHERE "capability_logs"."capability" = 'add_credits' AND "capability_logs"."status" = 'success' AND "capability_logs"."provider_request_id" = 'pi_3TUwTEJy1IhoKP6s1kzBcSdX' LIMIT 1
SELECT "actors".* FROM "actors" WHERE "actors"."id" = 1 LIMIT 1
INSERT INTO "capability_logs" ("actor_id", "capability", "version", "provider", "provider_request_id", "raw_cost_cents", "markup_cents", "total_charged_cents", "charged_to", "metadata_json", "status", "error_code", "invoked_at", "completed_at", "created_at", "updated_at") VALUES ('1', 'add_credits', NULL, 'stripe', 'pi_3TUwTEJy1IhoKP6s1kzBcSdX', 0, 0, 0, 'actor', NULL, 'success', NULL, '2026-05-08 22:02:09.708461', '2026-05-08 22:02:09.708500', '2026-05-08 22:02:09.709256', '2026-05-08 22:02:09.709256') RETURNING "id"