app/capabilities/stripe_capability/create_payment_intent_saved.rb

SELECT "actors".* FROM "actors" WHERE "actors"."id" = 1 LIMIT 1
---
    def call
      amount_cents = Integer(payload.fetch(:amount_cents))
      validate_topup_amount!(amount_cents)

      actor = Actor.find(actor_id)