app/capabilities/stripe_capability/create_payment_intent.rb

    def call
      amount_cents = Integer(payload.fetch(:amount_cents))
      validate_topup_amount!(amount_cents)

      actor       = Actor.find(actor_id)
---
SELECT "actors".* FROM "actors" WHERE "actors"."id" = 1 LIMIT 1