app/capabilities/stripe_capability/get_payment_methods.rb

    def call
      actor = Actor.find(actor_id)
---
SELECT "actors".* FROM "actors" WHERE "actors"."id" = 1 LIMIT 1