app/capabilities/stripe_capability/stripe_client.rb

    def already_credited?(payment_intent_id)
      CapabilityLog.exists?(
        capability: "add_credits",
        status:     "success",
        provider_request_id: payment_intent_id
      )
---
SELECT 1 AS one FROM "capability_logs" WHERE "capability_logs"."capability" = 'add_credits' AND "capability_logs"."status" = 'success' AND "capability_logs"."provider_request_id" = 'pi_3TUwBbJy1IhoKP6s1kNTVJV6' LIMIT 1