app/capabilities/billing/get_usage_logs.rb

SELECT "capability_logs".* FROM "capability_logs" WHERE "capability_logs"."actor_id" = '1' ORDER BY "capability_logs"."invoked_at" DESC LIMIT 50 OFFSET 0
SELECT SUM("capability_logs"."total_charged_cents") FROM "capability_logs" WHERE "capability_logs"."actor_id" = '1' AND (total_charged_cents > 0)
SELECT COUNT(*) FROM "capability_logs" WHERE "capability_logs"."actor_id" = '1' AND (total_charged_cents > 0)
---
    def call
      limit  = [ [ Integer(payload[:limit] || 50), 1 ].max, 200 ].min
      offset = [ Integer(payload[:offset] || 0), 0 ].max

      paid = CapabilityLog.where(actor_id: actor_id).where("total_charged_cents > 0")

      logs = paid
        .order(invoked_at: :desc)
        .limit(limit)
        .offset(offset)

      total_charged = paid.sum(:total_charged_cents)
      total_calls   = paid.count