app/capabilities/billing/get_balance.rb

SELECT "actors".* FROM "actors" WHERE "actors"."id" = 1 LIMIT 1
---
    def call
      actor = Actor.find(actor_id)