app/capabilities/plaid/plaid_client.rb

    def external_item_for(external_id)
      ExternalItem.find_by!(actor_id: actor_id, external_id: external_id, provider: "plaid")
---
SELECT "external_items".* FROM "external_items" WHERE "external_items"."actor_id" = '1' AND "external_items"."external_id" = 'EwnA4bOKJQtPDxxera5Mh6pzB95d7mC6LB4gO' AND "external_items"."provider" = 'plaid' LIMIT 1