app/capabilities/base_capability.rb

  def execute
    invoked_at = Time.current
    costs = CostCalculator.calculate(
      provider:   self.class.provider.to_s,
      capability: self.class.capability_name
    )

    # Enforce balance before doing any external work.
    if costs[:total_charged_cents] > 0
      actor = Actor.find(actor_id)
      unless actor.sufficient_balance?(costs[:total_charged_cents])
        raise Actor::InsufficientBalanceError,
          "Insufficient balance. Need #{costs[:total_charged_cents]}¢, have #{actor.balance_cents}¢."
      end
    end

    result = call

    # Deduct atomically after success (with_lock guards against races).
    Actor.find(actor_id).deduct!(costs[:total_charged_cents]) if costs[:total_charged_cents] > 0

    CapabilityLog.create!(
      actor_id:           actor_id,
      capability:         self.class.capability_name,
      version:            self.class.version,
      provider:           self.class.provider,
      provider_request_id: result[:provider_request_id],
      raw_cost_cents:     costs[:raw_cost_cents],
      markup_cents:       costs[:markup_cents],
      total_charged_cents: costs[:total_charged_cents],
      charged_to:         payload[:charged_to] || "actor",
      metadata_json:      payload[:metadata]&.to_json,
      status:             "success",
      invoked_at:         invoked_at,
      completed_at:       Time.current
    )

    result.merge(costs)
  rescue => e
    CapabilityLog.create!(
      actor_id:           actor_id,
      capability:         self.class.capability_name,
      version:            self.class.version,
      provider:           self.class.provider,
      raw_cost_cents:     0,
      markup_cents:       0,
      total_charged_cents: 0,
      charged_to:         payload[:charged_to] || "actor",
      status:             "failed",
      error_code:         e.class.name,
      invoked_at:         invoked_at,
      completed_at:       Time.current
    )
---
SELECT "actors".* FROM "actors" WHERE "actors"."id" = 1 LIMIT 1
INSERT INTO "capability_logs" ("actor_id", "capability", "version", "provider", "provider_request_id", "raw_cost_cents", "markup_cents", "total_charged_cents", "charged_to", "metadata_json", "status", "error_code", "invoked_at", "completed_at", "created_at", "updated_at") VALUES ('1', 'link_session', '1.0', 'plaid', '4e344ecfad65a31', 50, 1, 51, 'actor', NULL, 'success', NULL, '2026-05-07 14:03:29.878081', '2026-05-07 14:03:30.384685', '2026-05-07 14:03:30.397999', '2026-05-07 14:03:30.397999') RETURNING "id"
INSERT INTO "capability_logs" ("actor_id", "capability", "version", "provider", "provider_request_id", "raw_cost_cents", "markup_cents", "total_charged_cents", "charged_to", "metadata_json", "status", "error_code", "invoked_at", "completed_at", "created_at", "updated_at") VALUES ('1', 'link_session', '1.0', 'plaid', NULL, 0, 0, 0, 'actor', NULL, 'failed', 'Plaid::ApiError', '2026-05-07 14:01:45.095306', '2026-05-07 14:01:45.497352', '2026-05-07 14:01:45.509105', '2026-05-07 14:01:45.509105') RETURNING "id"